/*
▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓  ▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓  ▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓  ▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓  ▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓
▓▓▒▒▒▒▒▒▒▒▒▒▒▓▓  ▓▓▒▒▒▓▓▓▓▓▒▒▒▓▓  ▓▓▒▒▒▒▒▒▒▒▒▒▒▓▓  ▓▓▒▒▒▓▓▓▓▓▒▒▒▓▓  ▓▓▒▒▒▒▓▓▓▓▓▒▒▓▓
▓▓▒▒▒▓▓▓▓▓▒▒▒▓▓  ▓▓▒▒▒▓▓▓▓▓▒▒▒▓▓  ▓▓▒▒▒▓▓▓▓▓▒▒▒▓▓  ▓▓▒▒▒▓▓▓▓▓▒▒▒▓▓  ▓▓▒▒▒▒▓▓▓▓▓▒▒▓▓
▓▓▒▒▒▓▓▓▓▓▒▒▒▓▓  ▓▓▒▒▒▓▓▓▓▓▒▒▒▓▓  ▓▓▒▒▒▓▓▓▓▓▒▒▒▓▓  ▓▓▒▒▒▓▓▓▓▓▒▒▒▓▓  ▓▓▒▒▒▒▓▓▓▓▓▒▒▓▓
▓▓▒▒▒▓▓▓▓▓▓▓▓▓▓  ▓▓▒▒▒▓▓▓▓▓▒▒▒▓▓  ▓▓▒▒▒▓▓▓▓▓▒▒▒▓▓  ▓▓▒▒▒▓▓▓▓▓▒▒▒▓▓  ▓▓▒▒▓▒▒▓▓▓▓▒▒▓▓
▓▓▒▒▒▒▒▒▒▒▒▒▒▓▓  ▓▓▒▒▒▓▓▓▓▓▒▒▒▓▓  ▓▓▒▒▒▒▒▒▒▒▒▒▒▓▓  ▓▓▒▒▒▓▓▓▓▓▒▒▒▓▓  ▓▓▒▒▓▓▒▒▓▓▓▒▒▓▓
▓▓▓▓▓▓▓▓▓▓▒▒▒▓▓  ▓▓▒▒▒▓▓▓▓▓▒▒▒▓▓  ▓▓▒▒▒▓▓▓▓▓▓▓▓▓▓  ▓▓▒▒▒▓▓▓▓▓▒▒▒▓▓  ▓▓▒▒▓▓▓▒▒▓▓▒▒▓▓
▓▓▒▒▒▓▓▓▓▓▒▒▒▓▓  ▓▓▒▒▒▓▓▓▓▓▒▒▒▓▓  ▓▓▒▒▒▓▓▓▓▓▓▓▓▓▓  ▓▓▒▒▒▓▓▓▓▓▒▒▒▓▓  ▓▓▒▒▓▓▓▓▒▒▓▒▒▓▓
▓▓▒▒▒▓▓▓▓▓▒▒▒▓▓  ▓▓▒▒▒▓▓▓▓▓▒▒▒▓▓  ▓▓▒▒▒▓▓▓▓▓▓▓▓▓▓  ▓▓▒▒▒▓▓▓▓▓▒▒▒▓▓  ▓▓▒▒▓▓▓▓▓▒▒▒▒▓▓
▓▓▒▒▒▒▒▒▒▒▒▒▒▓▓  ▓▓▒▒▒▒▒▒▒▒▒▒▒▓▓  ▓▓▒▒▒▓▓▓▓▓▓▓▓▓▓  ▓▓▒▒▒▒▒▒▒▒▒▒▒▓▓  ▓▓▒▒▓▓▓▓▓▒▒▒▒▓▓
▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓  ▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓  ▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓  ▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓ ▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓ 


▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓  ▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓
▓▓▒▒▒▓▓▓▓▓▒▒▒▓▓  ▓▓▒▒▒▒▒▒▒▒▒▒▒▓▓
▓▓▒▒▒▓▓▓▓▓▒▒▒▓▓  ▓▓▒▒▒▓▓▓▓▓▒▒▒▓▓
▓▓▒▒▒▒▓▓▓▒▒▒▒▓▓  ▓▓▒▒▒▓▓▓▓▓▒▒▒▓▓
▓▓▒▒▓▒▓▓▓▒▓▒▒▓▓  ▓▓▒▒▒▓▓▓▓▓▒▒▒▓▓
▓▓▒▒▓▓▒▓▒▓▓▒▒▓▓  ▓▓▒▒▒▓▓▓▓▓▒▒▒▓▓
▓▓▒▒▓▓▒▒▒▓▓▒▒▓▓  ▓▓▒▒▒▓▓▓▓▓▒▒▒▓▓
▓▓▒▒▓▓▒▒▒▓▓▒▒▓▓  ▓▓▒▒▒▓▓▓▓▓▒▒▒▓▓
▓▓▒▒▓▓▓▓▓▓▓▒▒▓▓  ▓▓▒▒▒▓▓▓▓▓▒▒▒▓▓
▓▓▒▒▓▓▓▓▓▓▓▒▒▓▓  ▓▓▒▒▒▒▒▒▒▒▒▒▒▓▓
▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓  ▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓


Developed By Mr.Supun Fernando

Whatsapp Channel -> https://whatsapp.com/channel/0029VaXRYlrKwqSMF7Tswi38

Youtube Channel -> https://youtube.com/@darkshadow_zap?si=8js31BzLWISSdz12

Developer Contact -> 94718461889
**/



const _0x47548f=_0x52f4;(function(_0x6bdbcc,_0x3dcf69){const _0x4959db=_0x52f4,_0x5e794e=_0x6bdbcc();while(!![]){try{const _0x35695a=-parseInt(_0x4959db(0xd9))/0x1*(parseInt(_0x4959db(0xd3))/0x2)+parseInt(_0x4959db(0xc5))/0x3*(-parseInt(_0x4959db(0xc8))/0x4)+parseInt(_0x4959db(0xc1))/0x5*(parseInt(_0x4959db(0xd1))/0x6)+-parseInt(_0x4959db(0xce))/0x7*(-parseInt(_0x4959db(0xbf))/0x8)+-parseInt(_0x4959db(0xb8))/0x9+-parseInt(_0x4959db(0xd0))/0xa*(-parseInt(_0x4959db(0xc4))/0xb)+parseInt(_0x4959db(0xc3))/0xc;if(_0x35695a===_0x3dcf69)break;else _0x5e794e['push'](_0x5e794e['shift']());}catch(_0x4d1174){_0x5e794e['push'](_0x5e794e['shift']());}}}(_0x47b2,0x38ffd));function _0x52f4(_0x5f2698,_0x534c5e){const _0x47b260=_0x47b2();return _0x52f4=function(_0x52f4f3,_0x791d16){_0x52f4f3=_0x52f4f3-0xb8;let _0x53544b=_0x47b260[_0x52f4f3];return _0x53544b;},_0x52f4(_0x5f2698,_0x534c5e);}const fs=require('fs'),path=require('path'),config=require(_0x47548f(0xcd)),{fetchJson}=require(_0x47548f(0xca)),{readEnv}=require(_0x47548f(0xd5)),{cmd,commands}=require(_0x47548f(0xc0));function _0x47b2(){const _0x39cf79=['true','ALWAYS_ONLINE','reply','40phPcDa','../command','5BAyekZ','composing','5302152ljQixC','1556159FbKthh','1359inJGZp','../media/autosticker.json','AUTO_REPLY','16bKzoXD','toLowerCase','../lib/functions','join','parse','../config','154637bNMwRh','Sets\x20bot\x20status\x20as\x20available\x20or\x20unavailable.','20OJHXBL','556386hvJBrc','body','4duWYEE','key','../lib/database','available','readFileSync','utf8','160322FvQsjL','3348405zknTSq','sendPresenceUpdate','sendMessage','remoteJid'];_0x47b2=function(){return _0x39cf79;};return _0x47b2();}cmd({'on':_0x47548f(0xd2)},async(_0x37efa9,_0x1b2067,_0x52606e,{from:_0x4a1f24,body:_0x27dbf6,isOwner:_0x29f280})=>{const _0x370d95=_0x47548f,_0x39f2db=path[_0x370d95(0xcb)](__dirname,_0x370d95(0xc6)),_0x288f33=JSON[_0x370d95(0xcc)](fs['readFileSync'](_0x39f2db,'utf8'));for(const _0x49984e in _0x288f33){if(_0x27dbf6['toLowerCase']()===_0x49984e[_0x370d95(0xc9)]()){const _0x54635e=await readEnv();_0x54635e['AUTO_STICKER']===_0x370d95(0xbc)&&await _0x37efa9[_0x370d95(0xba)](_0x4a1f24,{'sticker':{'url':_0x288f33[_0x49984e]},'package':'yourName'},{'quoted':_0x1b2067});}}}),cmd({'on':'body'},async(_0x3529c4,_0x66d747,_0x274c39,{from:_0x2d31d5,body:_0x3f443f,isOwner:_0x447a6c})=>{const _0x36f504=_0x47548f,_0xc1e26e=path[_0x36f504(0xcb)](__dirname,'../media/autoreply.json'),_0x3ffca3=JSON[_0x36f504(0xcc)](fs[_0x36f504(0xd7)](_0xc1e26e,_0x36f504(0xd8)));for(const _0x479692 in _0x3ffca3){if(_0x3f443f['toLowerCase']()===_0x479692[_0x36f504(0xc9)]()){const _0x8ec7a0=await readEnv();_0x8ec7a0[_0x36f504(0xc7)]==='true'&&await _0x274c39[_0x36f504(0xbe)](_0x3ffca3[_0x479692]);}}}),cmd({'pattern':_0x47548f(0xd6),'react':'🟢','desc':_0x47548f(0xcf),'category':'status','filename':__filename},async(_0x560b89,_0x4ce154,_0x372240,{isOwner:_0x4f18ab,reply:_0x90804f})=>{const _0x5b6a37=_0x47548f,_0x10e25d=await readEnv();_0x10e25d[_0x5b6a37(0xbd)]===!![]?_0x560b89[_0x5b6a37(0xb9)](_0x5b6a37(0xd6),_0x4ce154[_0x5b6a37(0xd4)][_0x5b6a37(0xbb)]):_0x560b89[_0x5b6a37(0xb9)]('unavailable',_0x4ce154[_0x5b6a37(0xd4)][_0x5b6a37(0xbb)]);}),cmd({'pattern':_0x47548f(0xd2),'react':'📝','desc':'Sends\x20typing\x20status.','category':'status','filename':__filename},async(_0x52807a,_0x470f9b,_0x328dac,{body:_0x3b1f4e,reply:_0x44f5ca})=>{const _0x4ddda2=_0x47548f,_0xadf3ce=await readEnv();_0xadf3ce['CURRENT_STATUS']===!![]?_0x52807a[_0x4ddda2(0xb9)](_0x4ddda2(0xc2),_0x470f9b[_0x4ddda2(0xd4)][_0x4ddda2(0xbb)]):_0x52807a[_0x4ddda2(0xb9)](_0x4ddda2(0xd6),_0x470f9b['key'][_0x4ddda2(0xbb)]);});
