/*
▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓  ▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓  ▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓  ▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓  ▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓
▓▓▒▒▒▒▒▒▒▒▒▒▒▓▓  ▓▓▒▒▒▓▓▓▓▓▒▒▒▓▓  ▓▓▒▒▒▒▒▒▒▒▒▒▒▓▓  ▓▓▒▒▒▓▓▓▓▓▒▒▒▓▓  ▓▓▒▒▒▒▓▓▓▓▓▒▒▓▓
▓▓▒▒▒▓▓▓▓▓▒▒▒▓▓  ▓▓▒▒▒▓▓▓▓▓▒▒▒▓▓  ▓▓▒▒▒▓▓▓▓▓▒▒▒▓▓  ▓▓▒▒▒▓▓▓▓▓▒▒▒▓▓  ▓▓▒▒▒▒▓▓▓▓▓▒▒▓▓
▓▓▒▒▒▓▓▓▓▓▒▒▒▓▓  ▓▓▒▒▒▓▓▓▓▓▒▒▒▓▓  ▓▓▒▒▒▓▓▓▓▓▒▒▒▓▓  ▓▓▒▒▒▓▓▓▓▓▒▒▒▓▓  ▓▓▒▒▒▒▓▓▓▓▓▒▒▓▓
▓▓▒▒▒▓▓▓▓▓▓▓▓▓▓  ▓▓▒▒▒▓▓▓▓▓▒▒▒▓▓  ▓▓▒▒▒▓▓▓▓▓▒▒▒▓▓  ▓▓▒▒▒▓▓▓▓▓▒▒▒▓▓  ▓▓▒▒▓▒▒▓▓▓▓▒▒▓▓
▓▓▒▒▒▒▒▒▒▒▒▒▒▓▓  ▓▓▒▒▒▓▓▓▓▓▒▒▒▓▓  ▓▓▒▒▒▒▒▒▒▒▒▒▒▓▓  ▓▓▒▒▒▓▓▓▓▓▒▒▒▓▓  ▓▓▒▒▓▓▒▒▓▓▓▒▒▓▓
▓▓▓▓▓▓▓▓▓▓▒▒▒▓▓  ▓▓▒▒▒▓▓▓▓▓▒▒▒▓▓  ▓▓▒▒▒▓▓▓▓▓▓▓▓▓▓  ▓▓▒▒▒▓▓▓▓▓▒▒▒▓▓  ▓▓▒▒▓▓▓▒▒▓▓▒▒▓▓
▓▓▒▒▒▓▓▓▓▓▒▒▒▓▓  ▓▓▒▒▒▓▓▓▓▓▒▒▒▓▓  ▓▓▒▒▒▓▓▓▓▓▓▓▓▓▓  ▓▓▒▒▒▓▓▓▓▓▒▒▒▓▓  ▓▓▒▒▓▓▓▓▒▒▓▒▒▓▓
▓▓▒▒▒▓▓▓▓▓▒▒▒▓▓  ▓▓▒▒▒▓▓▓▓▓▒▒▒▓▓  ▓▓▒▒▒▓▓▓▓▓▓▓▓▓▓  ▓▓▒▒▒▓▓▓▓▓▒▒▒▓▓  ▓▓▒▒▓▓▓▓▓▒▒▒▒▓▓
▓▓▒▒▒▒▒▒▒▒▒▒▒▓▓  ▓▓▒▒▒▒▒▒▒▒▒▒▒▓▓  ▓▓▒▒▒▓▓▓▓▓▓▓▓▓▓  ▓▓▒▒▒▒▒▒▒▒▒▒▒▓▓  ▓▓▒▒▓▓▓▓▓▒▒▒▒▓▓
▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓  ▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓  ▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓  ▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓ ▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓ 


▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓  ▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓
▓▓▒▒▒▓▓▓▓▓▒▒▒▓▓  ▓▓▒▒▒▒▒▒▒▒▒▒▒▓▓
▓▓▒▒▒▓▓▓▓▓▒▒▒▓▓  ▓▓▒▒▒▓▓▓▓▓▒▒▒▓▓
▓▓▒▒▒▒▓▓▓▒▒▒▒▓▓  ▓▓▒▒▒▓▓▓▓▓▒▒▒▓▓
▓▓▒▒▓▒▓▓▓▒▓▒▒▓▓  ▓▓▒▒▒▓▓▓▓▓▒▒▒▓▓
▓▓▒▒▓▓▒▓▒▓▓▒▒▓▓  ▓▓▒▒▒▓▓▓▓▓▒▒▒▓▓
▓▓▒▒▓▓▒▒▒▓▓▒▒▓▓  ▓▓▒▒▒▓▓▓▓▓▒▒▒▓▓
▓▓▒▒▓▓▒▒▒▓▓▒▒▓▓  ▓▓▒▒▒▓▓▓▓▓▒▒▒▓▓
▓▓▒▒▓▓▓▓▓▓▓▒▒▓▓  ▓▓▒▒▒▓▓▓▓▓▒▒▒▓▓
▓▓▒▒▓▓▓▓▓▓▓▒▒▓▓  ▓▓▒▒▒▒▒▒▒▒▒▒▒▓▓
▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓  ▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓


Developed By Mr.Supun Fernando

Whatsapp Channel -> https://whatsapp.com/channel/0029VaXRYlrKwqSMF7Tswi38

Youtube Channel -> https://youtube.com/@darkshadow_zap?si=8js31BzLWISSdz12

Developer Contact -> 94718461889
**/


function _0xa4f9(_0x2bd06c,_0x1d154f){const _0x69cb75=_0x69cb();return _0xa4f9=function(_0xa4f9c3,_0x436d72){_0xa4f9c3=_0xa4f9c3-0x10d;let _0x42f7d8=_0x69cb75[_0xa4f9c3];return _0x42f7d8;},_0xa4f9(_0x2bd06c,_0x1d154f);}const _0x5ecf20=_0xa4f9;function _0x69cb(){const _0x1d5a1b=['ALWAYS_RECORDING','🛜\x20MongoDB\x20Connected\x20✅','mongoose','7918932MnoHSZ','OWNER_REACT','AUTO_BIO','error','exports','exit','./mongodbenv','BAD_NO_BLOCK','AUTO_VOICE','`𝒀𝒐𝒖𝒓\x20𝒔𝒕𝒂𝒕𝒖𝒔\x20𝒔𝒆𝒆𝒏\x20𝒋𝒖𝒔𝒕\x20𝒏𝒐𝒘\x20𝒃𝒚\x20♥️🌸⃝𝐒𝐔𝐏𝐔𝐍\x20𝐌𝐃ᥫ᭡👑`','OWNER_NUMBER','connect','1633066eCkeDm','ANTI_LINKK','MODE','false','6pmfDGU','create','3298802VFXRWd','public','ALWAYS_ONLINE','../config','CURRENT_STATUS','AUTO_STICKER','FOOTER','AUTO_REPLY','findOne','ANTI_BAD','31141377aruhRz','ANTI_CALL','5158570cWbYOL','ANTI_LINK','>\x20ᴘᴀᴡᴇʀᴇᴅ\x20ʙʏ\x20ꜱᴜᴘᴜɴ\x20ᴍᴅ','MONGODB','AUTO_STATUS__MSG','message','key','ALWAYS_TYPING','ALLWAYS_OFFLINE','517504OHdcvj','LANG','AUTO_REACT','HEART_REACT','AUTO_STATUS_REPLY','384117XXyEZr','AUTO_READ_CMD','log','44ZscYwG','true','➕\x20Created\x20default\x20env\x20var:\x20'];_0x69cb=function(){return _0x1d5a1b;};return _0x69cb();}(function(_0x56c752,_0x46ea6a){const _0xbfa4c8=_0xa4f9,_0x292efc=_0x56c752();while(!![]){try{const _0x4acdce=-parseInt(_0xbfa4c8(0x11e))/0x1+-parseInt(_0xbfa4c8(0x124))/0x2+-parseInt(_0xbfa4c8(0x13e))/0x3*(parseInt(_0xbfa4c8(0x141))/0x4)+parseInt(_0xbfa4c8(0x130))/0x5+-parseInt(_0xbfa4c8(0x122))/0x6*(-parseInt(_0xbfa4c8(0x112))/0x7)+-parseInt(_0xbfa4c8(0x139))/0x8+parseInt(_0xbfa4c8(0x12e))/0x9;if(_0x4acdce===_0x46ea6a)break;else _0x292efc['push'](_0x292efc['shift']());}catch(_0x3e1681){_0x292efc['push'](_0x292efc['shift']());}}}(_0x69cb,0xd3ce7));const mongoose=require(_0x5ecf20(0x111)),config=require(_0x5ecf20(0x127)),EnvVar=require(_0x5ecf20(0x118)),defaultEnvVariables=[{'key':'AUTO_READ_STATUS','value':_0x5ecf20(0x10d)},{'key':_0x5ecf20(0x11a),'value':'true'},{'key':_0x5ecf20(0x120),'value':_0x5ecf20(0x125)},{'key':_0x5ecf20(0x129),'value':_0x5ecf20(0x121)},{'key':_0x5ecf20(0x12b),'value':'false'},{'key':_0x5ecf20(0x13b),'value':_0x5ecf20(0x10d)},{'key':_0x5ecf20(0x13c),'value':_0x5ecf20(0x10d)},{'key':_0x5ecf20(0x13a),'value':'EN'},{'key':_0x5ecf20(0x113),'value':'true'},{'key':'PREFIX','value':'.'},{'key':'ANTI_BOT','value':_0x5ecf20(0x121)},{'key':_0x5ecf20(0x12f),'value':_0x5ecf20(0x121)},{'key':_0x5ecf20(0x12d),'value':'true'},{'key':_0x5ecf20(0x131),'value':_0x5ecf20(0x10d)},{'key':_0x5ecf20(0x11f),'value':_0x5ecf20(0x121)},{'key':_0x5ecf20(0x119),'value':_0x5ecf20(0x121)},{'key':_0x5ecf20(0x138),'value':_0x5ecf20(0x121)},{'key':_0x5ecf20(0x137),'value':_0x5ecf20(0x121)},{'key':_0x5ecf20(0x10f),'value':_0x5ecf20(0x10d)},{'key':_0x5ecf20(0x13d),'value':'false'},{'key':_0x5ecf20(0x134),'value':_0x5ecf20(0x11b)},{'key':_0x5ecf20(0x114),'value':'true'},{'key':_0x5ecf20(0x12a),'value':_0x5ecf20(0x132)},{'key':_0x5ecf20(0x13f),'value':_0x5ecf20(0x10d)},{'key':_0x5ecf20(0x11c),'value':'94718461889'},{'key':_0x5ecf20(0x126),'value':_0x5ecf20(0x10d)},{'key':_0x5ecf20(0x128),'value':'false'}],connectDB=async()=>{const _0x3f1502=_0x5ecf20;try{await mongoose[_0x3f1502(0x11d)](config[_0x3f1502(0x133)]),console[_0x3f1502(0x140)](_0x3f1502(0x110));for(const _0x505fd7 of defaultEnvVariables){const _0x262b52=await EnvVar[_0x3f1502(0x12c)]({'key':_0x505fd7[_0x3f1502(0x136)]});!_0x262b52&&(await EnvVar[_0x3f1502(0x123)](_0x505fd7),console[_0x3f1502(0x140)](_0x3f1502(0x10e)+_0x505fd7[_0x3f1502(0x136)]));}}catch(_0x5ceabb){console[_0x3f1502(0x115)](_0x5ceabb[_0x3f1502(0x135)]),process[_0x3f1502(0x117)](0x1);}};module[_0x5ecf20(0x116)]=connectDB;
